<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/2_Aggregation.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Aggregation in Window Functions

## Overview

### ü•Ö Analysis Goals

- **Total Users by Cohort:** Get the total number of unique users in each cohort to get insight into the scale of each cohort. Helps evaluate the relative size of cohorts, which is essential for benchmarking revenue.
- **Cohort-Based LTV Analysis:** Assign each customer to a cohort based on their first purchase year, calculate their average LTV across all customers within each cohort to analyze customer value trends.
- **Filtered Average LTV by Customer:** Aggregate total revenue per customer, filter out the order year.

### üìò Concepts Covered

- `COUNT()`
- `AVG()`
- Filtering windows functions

In [12]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## COUNT

### üìù¬†Notes

`COUNT`

- **COUNT**: Counts the values, `DISTINCT` can be added to get the unique count.
- Syntax: 
  ```sql
    SELECT
      COUNT() OVER(
          PARTITION BY partition_expression
      ) AS window_column_alias
      FROM table_name
  ```

### üîë Key Concepts
- **üìä Business Terms**: 
  - Customer Cohort: Group of customers who made their first purchase in the same time period
  - User Acquisition: Process of gaining new customers
  - Customer Base: Total number of active customers
- **üí° Why It Matters**: Essential for understanding customer growth and comparing performance across different sized groups (e.g. segements).
- **üéØ Common Use Cases**: Tracking new customer growth, measuring retention rates
- **üìà Related Metrics**: Acquisition rate, retention rate, churn rate

### üìà Analysis

-  Group customers by the year of their first purchase, then calculate the total number of customers in each cohort to analyze customer retention and growth trends over time.

#### Total Count of Customers by Cohort

**`COUNT()`, `OVER`, `PARTITION BY`**

1. Get the cohorts by year from the `orderdate` and the `customerkey` in the `sales` table.
    - Use `EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey))` to find the earliest year a customer placed an order.
    - Select `customerkey` to associate each customer with their cohort year.

In [13]:
%%sql

SELECT 
    customerkey,
    EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year
FROM sales

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

199873 rows affected.

        customerkey cohort_year
0                15        2021
1               180        2018
2               180        2018
3               180        2018
4               185        2019
...             ...         ...
199868      2099711        2016
199869      2099711        2016
199870      2099743        2022
199871      2099743        2022
199872      2099743        2022

[199873 rows x 2 columns]

2. Add in the purchase year using `EXTRACT`.
    - Use `EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey))` to find the earliest year a customer placed an order.
    - Select `customerkey` to associate each customer with their cohort year.
    - üîî Get the `purchase_year` using `EXTRACT(YEAR FROM orderdate) AS purchase_year`

In [14]:
%%sql

SELECT 
    customerkey,
    EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year,
    EXTRACT(YEAR FROM orderdate) AS purchase_year -- Added
FROM sales

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

199873 rows affected.

        customerkey cohort_year purchase_year
0                15        2021          2021
1               180        2018          2018
2               180        2018          2023
3               180        2018          2023
4               185        2019          2019
...             ...         ...           ...
199868      2099711        2016          2017
199869      2099711        2016          2016
199870      2099743        2022          2022
199871      2099743        2022          2022
199872      2099743        2022          2023

[199873 rows x 3 columns]

3. Get total customers by cohort using window functions.
    - üîî First create a CTE to identify each customer's cohort year
        - Use `EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey))` to find the earliest year a customer placed an order.
        - Select `customerkey` to associate each customer with their cohort year.
        - Get the `purchase_year` using `EXTRACT(YEAR FROM orderdate) AS purchase_year`
        - Use `DISTINCT` for the SELECT statement. 
    - In the main query:
        - Select the `cohort_year` and `purchase_year`
        - Use `COUNT(customerkey) OVER (PARTITION BY purchase_year, cohort_year)` to count customers in each cohort
        - Add `DISTINCT` to show only one row per cohort year
        - Order by cohort year to show progression

> NOTE: You could achieve this more easily with `GROUP BY`:
> ```sql
> SELECT 
>    COUNT(DISTINCT customerkey),
>    EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year,
>    EXTRACT(YEAR FROM orderdate) AS purchase_year
> FROM sales
> GROUP BY
>    cohort_year
>    purchase_year
> ```

In [15]:
%%sql

-- Put previous query into CTE
WITH yearly_cohort AS (
    SELECT DISTINCT -- Updated
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year,
        EXTRACT(YEAR FROM orderdate) AS purchase_year
    FROM sales
)

-- Added
SELECT DISTINCT
    cohort_year,
    purchase_year,
    COUNT(customerkey) OVER (PARTITION BY purchase_year, cohort_year) AS num_customers
FROM yearly_cohort
ORDER BY cohort_year, purchase_year;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

55 rows affected.

   cohort_year purchase_year  num_customers
0         2015          2015           2825
1         2015          2016            126
2         2015          2017            149
3         2015          2018            348
4         2015          2019            388
5         2015          2020            171
6         2015          2021            295
7         2015          2022            600
8         2015          2023            499
9         2015          2024            146
10        2016          2016           3397
11        2016          2017            174
12        2016          2018            374
13        2016          2019            457
14        2016          2020            205
15        2016          2021            336
16        2016          2022            746
17        2016          2023            573
18        2016          2024            183
19        2017          2017           4068
20        2017          2018            473
21        2017          2019            570
22        2017          2020            251
23        2017          2021            450
24        2017          2022            943
25        2017          2023            738
26        2017          2024            246
27        2018          2018           7446
28        2018          2019           1081
29        2018          2020            475
30        2018          2021            779
31        2018          2022           1644
32        2018          2023           1407
33        2018          2024            426
34        2019          2019           7755
35        2019          2020            523
36        2019          2021            873
37        2019          2022           1700
38        2019          2023           1439
39        2019          2024            370
40        2020          2020           3031
41        2020          2021            358
42        2020          2022            694
43        2020          2023            547
44        2020          2024            163
45        2021          2021           4663
46        2021          2022           1051
47        2021          2023            889
48        2021          2024            268
49        2022          2022           9010
50        2022          2023           1764
51        2022          2024            561
52        2023          2023           5890
53        2023          2024            332
54        2024          2024           1402

<img src="../Resources/images/3.2_cohort_customer_yearly.png" alt="Cohort Customers" width="50%">  

> NOTE: Earlier cohorts continue to contribute to customer growth in future years, but their impact compared to new customer acquisitions is minimal.  
> 
> Driving the questions: Why are more resources not spent on customer retention?

---
## Average

### üìù¬†Notes

- `AVG()`: Calculates the average of the values

```sql
  SELECT
    AVG() OVER(
         PARTITION BY partition_expression
    ) AS window_column_alias
    FROM table_name
```

### üîë Key Concepts
- **üìä Business Terms**:
  - Customer Lifetime Value (LTV): Total revenue generated by a customer over time
  - Average Order Value (AOV): Typical amount spent per transaction
  - Revenue Per User: Average revenue generated by each customer
- **üí° Why It Matters**: Helps identify valuable customer segments and predict future revenue
- **üéØ Common Use Cases**: Calculating customer LTV, analyzing spending patterns
- **üìà Related Metrics**: ARPU (Average Revenue Per User), CAC (Customer Acquisition Cost)

### üìï Definitions

- **Lifetime Value (LTV)**: the total revenue a customer generates for a business over their entire relationship.


### üìà Analysis
- Aggregate total revenue per user and calculate the average lifetime value for each cohort.

#### Average LTV by Cohort

**`AVG()`, `OVER`, `PARTITION BY`**

1. Get the `cohort_year` and the total revenue for each user.  
   - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer.  
   - Group by `customerkey` to ensure the revenue and cohort year are calculated per user.  
   - Calculate the total revenue for each customer using `SUM(quantity * netprice * exchangerate)`.  
   - Select `cohort_year`, `customerkey`, and the total revenue (`total_customer_net_revenue`) to display the results.

In [16]:
%%sql

SELECT 
    customerkey,
    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
    SUM(quantity * netprice * exchangerate) AS customer_ltv
FROM sales
GROUP BY 
    customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

       customerkey cohort_year  customer_ltv
0          2044589        2018       2470.73
1          1603477        2021        136.62
2           876049        2017       2601.13
3          1469222        2024       5278.54
4          2089398        2018         98.39
...            ...         ...           ...
49482       853617        2019        903.31
49483      1573639        2016       6973.42
49484      1355936        2022        149.99
49485       967453        2024          5.40
49486        34354        2022        828.80

[49487 rows x 3 columns]

2. Create a CTE to calculate the cohort year for each customer and their net revenue and return all results in the main query.  
   - üîî Define a CTE `yearly_cohort` to extract the cohort year for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` in the CTE to determine the earliest order year for each customer. 
        - Calculate the total revenue for each customer using `SUM(quantity * netprice * exchangerate)`.  
        - Group by `customerkey` in the CTE to assign each customer to a single cohort year.  
   - üîî In the main query, use `SELECT * FROM yearly_cohort` to return all the results from the CTE.

In [17]:
%%sql

WITH yearly_cohort AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        SUM(quantity * netprice * exchangerate) AS customer_ltv
        FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    *
FROM yearly_cohort
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

       customerkey cohort_year  customer_ltv
0          2044589        2018       2470.73
1          1603477        2021        136.62
2           876049        2017       2601.13
3          1469222        2024       5278.54
4          2089398        2018         98.39
...            ...         ...           ...
49482       853617        2019        903.31
49483      1573639        2016       6973.42
49484      1355936        2022        149.99
49485       967453        2024          5.40
49486        34354        2022        828.80

[49487 rows x 3 columns]

3. Get the average customer LTV along side the average LTV for each cohort.
        - Extract the cohort year using `EXTRACT(YEAR FROM MIN(orderdate))`.  
        - Calculate the total revenue for each customer with `SUM(quantity * netprice * exchangerate)`.  
        - Group by `customerkey` to ensure total revenue and cohort year are assigned to each customer.  
   - In the main query: 
        - üîî Use `AVG(total_customer_net_revenue) OVER (PARTITION BY cohort_year)` to calculate the average revenue per customer for each cohort.  
        - üîî Select `cohort_year`, `customerkey`, `total_customer_net_revenue` (rename this to `customer_ltv`) and the average total revenue for output.  
        - üîî Use `ORDER BY cohort_year, customerkey` to sort the results by cohort and customer.

In [18]:
%%sql

WITH yearly_cohort AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        SUM(quantity * netprice * exchangerate) AS customer_ltv 
    FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    cohort_year, -- Updated
    customerkey, -- Updated
    customer_ltv, -- Updated
    AVG(customer_ltv) OVER (PARTITION BY cohort_year) AS avg_cohort_ltv-- Added
FROM yearly_cohort
ORDER BY -- Added
    cohort_year,
    customerkey
LIMIT 20

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

20 rows affected.

   cohort_year  customerkey  customer_ltv  avg_cohort_ltv
0         2015         4376        182.00         5271.59
1         2015         4403       9530.35         5271.59
2         2015         4925       6078.08         5271.59
3         2015         5729        192.16         5271.59
4         2015         6048       1903.89         5271.59
5         2015         6705      13133.76         5271.59
6         2015         9440        208.01         5271.59
7         2015        10806        442.09         5271.59
8         2015        12116       9714.29         5271.59
9         2015        12973        253.06         5271.59
10        2015        14413       2557.62         5271.59
11        2015        14527         81.65         5271.59
12        2015        18123       5936.11         5271.59
13        2015        19864       6592.29         5271.59
14        2015        19883      19488.83         5271.59
15        2015        23698       4424.89         5271.59
16        2015        27951        963.47         5271.59
17        2015        28027       6269.44         5271.59
18        2015        32799       1972.01         5271.59
19        2015        32825       3675.01         5271.59

<img src="../Resources/images/3.2_customer_ltv.png" alt="Customer LTV & Average LTV" width="50%">

> ‚ö†Ô∏è **Chart Note**: This plots only 20 of our customers for a better visualization.

4. (BONUS) Get the average LTV for each cohort.
    - Create a CTE `cohort_summary` to calculate the average LTV for each cohort.
    - Select the `cohort_year` and the average LTV for each cohort.
    - Order by `cohort_year`.
    - Use `DISTINCT` to avoid duplicate rows.

In [19]:
%%sql

WITH yearly_cohort AS (
    SELECT 
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        SUM(quantity * netprice * exchangerate) AS customer_ltv 
    FROM sales
    GROUP BY 
        customerkey
), cohort_summary AS (
    SELECT 
        cohort_year, 
        customerkey, 
        customer_ltv, 
        AVG(customer_ltv) OVER (PARTITION BY cohort_year) AS avg_cohort_ltv
    FROM yearly_cohort
    ORDER BY 
        cohort_year,
        customerkey
)
SELECT DISTINCT
    cohort_year,
    avg_cohort_ltv
FROM cohort_summary
ORDER BY
    cohort_year

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

  cohort_year  avg_cohort_ltv
0        2015         5271.59
1        2016         5404.92
2        2017         5403.08
3        2018         4896.64
4        2019         4731.95
5        2020         3933.32
6        2021         3943.33
7        2022         3315.52
8        2023         2543.18
9        2024         2037.55

<img src="../Resources/images/3.2_cohort_ltv.png" alt="Cohort LTV" width="50%">

---
## Filtering Windows Function

### üìù¬†Notes

**Filtering Before Windows Function**

- Use `WHERE` to filter rows before aggregation. 
- Syntax: 
    ```sql
    SELECT 
        column_name,
        window_function(column_to_aggregate) 
            OVER (PARTITION BY partition_column) AS window_column_alias   
    FROM table_name
    WHERE condition; -- Filters data BEFORE applying window function
    ```

**EXAMPLE:** Only create cohorts from 2020 onward; can use customers from early years.

In [20]:
%%sql

SELECT 
    customerkey,
    EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year
FROM sales
WHERE orderdate >= '2020-01-01'  -- Filters BEFORE window function
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey cohort_year
0           15        2021
1          180        2023
2          180        2023
3          387        2021
4          387        2021
5          387        2021
6          387        2021
7          387        2021
8          406        2021
9          406        2021

**Fitlering After Windows Function**

- Use a subquery + `WHERE` to filter based on window function results.  
- Syntax: 
    ```sql
    WITH windowed_data AS (
        SELECT 
            column_name,
            window_function(column_to_aggregate) 
                OVER (PARTITION BY partition_column) AS window_column_alias
        FROM table_name
    )

    SELECT *
    FROM windowed_data
    WHERE window_column_alias condition; -- Filters data AFTER window function
    ```

**EXAMPLE:** Only create cohorts from 2020 onward AND only with customers that purchased after 2020.

In [21]:
%%sql

WITH cohort AS (
  SELECT 
      customerkey,
      EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year
  FROM sales
)
SELECT *
FROM cohort
WHERE cohort_year >= '2020'

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

81370 rows affected.

       customerkey cohort_year
0               15        2021
1              406        2021
2              406        2021
3              545        2023
4              545        2023
...            ...         ...
81365      2099697        2022
81366      2099697        2022
81367      2099743        2022
81368      2099743        2022
81369      2099743        2022

[81370 rows x 2 columns]

#### üí° What about `QUALIFY`?  

- Some databases (**BigQuery, Snowflake**) support `QUALIFY` to filter directly on **window function results**.  
- **PostgreSQL does not support `QUALIFY`**, so we use a CTE or subquery with a `WHERE` clause instead.

---

## Window Functions and Group By

### üìù¬†Notes
### üö´ Avoid Combining `GROUP BY` with Window Functions  

When using **window functions** in SQL, it's not recommended to combine them directly with `GROUP BY`. This is because:  

- **Conflicting Aggregations**: `GROUP BY` collapses rows into groups, but window functions operate on individual rows while maintaining access to the full dataset. This can lead to unexpected results or errors.  
- **Better Alternatives**: Use **Common Table Expressions (CTEs)** or **subqueries** to first apply the window function, then perform `GROUP BY` in a separate step for clarity and correctness.  


### üìà Analysis
- Calculate the total number of orders for each customer using window functions
- Combine this with `GROUP BY` to get the total number of orders for each customer

In [44]:
%%sql

SELECT 
    customerkey,
    AVG(quantity * netprice * exchangerate) as net_revenue,
    COUNT(*) OVER(PARTITION BY customerkey) as total_orders  -- This will give wrong results!
FROM sales
GROUP BY customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

       customerkey  net_revenue  total_orders
0               15      2217.41             1
1              180       836.74             1
2              185      1395.52             1
3              243       287.67             1
4              387       517.32             1
...            ...          ...           ...
49482      2099619       838.74             1
49483      2099656       800.36             1
49484      2099697        12.73             1
49485      2099711      3004.34             1
49486      2099743       356.03             1

[49487 rows x 3 columns]

Here is a more likely example of what you would want to do:

In [36]:
%%sql

SELECT 
    customerkey,
    AVG(quantity * netprice * exchangerate) as avg_order_value,
    COUNT(customerkey) OVER(PARTITION BY customerkey) as total_orders
FROM sales
GROUP BY customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

       customerkey  avg_order_value  total_orders
0               15          2217.41             1
1              180           836.74             1
2              185          1395.52             1
3              243           287.67             1
4              387           517.32             1
...            ...              ...           ...
49482      2099619           838.74             1
49483      2099656           800.36             1
49484      2099697            12.73             1
49485      2099711          3004.34             1
49486      2099743           356.03             1

[49487 rows x 3 columns]

In [43]:
%%sql

WITH customer_orders AS (
    SELECT 
        customerkey,
        quantity * netprice * exchangerate as order_value,
        COUNT(customerkey) OVER(PARTITION BY customerkey) as total_orders
    FROM sales
)
SELECT 
    customerkey,
    total_orders,
    AVG(order_value) as avg_order_value
FROM customer_orders
GROUP BY
    customerkey, 
    total_orders
ORDER BY
    customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

       customerkey  total_orders  avg_order_value
0               15             1          2217.41
1              180             3           836.74
2              185             1          1395.52
3              243             1           287.67
4              387             9           517.32
...            ...           ...              ...
49482      2099619             8           838.74
49483      2099656            13           800.36
49484      2099697             3            12.73
49485      2099711             2          3004.34
49486      2099743             3           356.03

[49487 rows x 3 columns]